Ebiroll/qemu-stm32/hw/arm/stm32l552_soc.c
#define SYSCFG_ADD                     0x40010000

// LPUART1 0x40008000
static const uint32_t usart_addr[] = { 0x40013800, 
        0x40004400, 0x40004800, 0x40004C00 , 0x40005000 }; 
//                                        , 0x40004800,
//                                       0x40007800, 0x40007C00 };
/* At the moment only Timer 2 to 5 are modelled */
//static const uint32_t timer_addr[] = { 0x40000000, 0x40000400,
//                                       0x40000800, 0x40000C00 };

static const uint32_t timer_addr[] = { 0x40012C00, 0x40000000, 0x40000400,
                                       0x40000800, 0x40000C00 , 0x40001000 , 0x40001400 };


// static const uint32_t adc_addr[] = { 0x42028000 };  // 0x42028000


static const uint32_t spi_addr[] =   { 0x40013000, 0x40003800, 0x40003C00 };

#define EXTI_ADDR                      0x40013C00

#define SYSCFG_IRQ               71
static const int usart_irq[] = { 61, 62, 63, 64, 65};
static const int timer_irq[] = { 44,45,46,47,48,49,50,51 };
#define ADC_IRQ 18
// TODO SPI3 IRQ is 99!
static const int spi_irq[] =   { 59,60 ,61, 0, 0 };
static const int exti_irq[] =  { 11, 12,13,14,15,16,17,18,
                                 19, 20,21,22,23,24,25,26,27} ;

void init_m33_features(Object *obj);

void init_m33_features(Object *obj) {
    ARMCPU *cpu = ARM_CPU(obj);
    set_feature(&cpu->env, ARM_FEATURE_V8);
    set_feature(&cpu->env, ARM_FEATURE_M);
    set_feature(&cpu->env, ARM_FEATURE_M_MAIN);
    unset_feature(&cpu->env, ARM_FEATURE_M_SECURITY);
    set_feature(&cpu->env, ARM_FEATURE_THUMB_DSP);
    //set_feature(&cpu->env,ARM_FEATURE_V8_1M);
    cpu->midr = 0x410fd213; // r0p3 
    cpu->pmsav7_dregion = 16;
    cpu->sau_sregion = 8;
    cpu->isar.mvfr0 = 0x10110021;
    cpu->isar.mvfr1 = 0x11000011;
    cpu->isar.mvfr2 = 0x00000040;
    cpu->isar.id_pfr0 = 0x00000030;
    cpu->isar.id_pfr1 = 0x00000210;
    cpu->isar.id_dfr0 = 0x00200000;
    cpu->id_afr0 = 0x00000000;
    cpu->isar.id_mmfr0 = 0x00101F40;
    cpu->isar.id_mmfr1 = 0x00000000;
    cpu->isar.id_mmfr2 = 0x01000000;
    cpu->isar.id_mmfr3 = 0x00000000;
    cpu->isar.id_isar0 = 0x01101110;
    cpu->isar.id_isar1 = 0x02212000;
    cpu->isar.id_isar2 = 0x20232232;
    cpu->isar.id_isar3 = 0x01111131;
    cpu->isar.id_isar4 = 0x01310132;
    cpu->isar.id_isar5 = 0x00000000;
    cpu->isar.id_isar6 = 0x00000000;
    cpu->clidr = 0x00000000;
    cpu->ctr = 0x8000c000;
    cpu->env.v7m.secure = false;
}

extern hwaddr bitband_output_addr[2];

static void stm32l552_soc_initfn(Object *obj)
{
    STM32L552State *s = STM32L552_SOC(obj);
    int i;


  bitband_output_addr[1] = 0x50000000;  // OLAS ACHTUNG Fixme 0x50000000

    object_initialize_child(obj, "armv7m", &s->armv7m, TYPE_ARMV7M);

    object_initialize_child(obj, "syscfg", &s->syscfg, TYPE_STM32LXXX_SYSCFG);

    for (i = 0; i < STM32L552_NUM_USARTS; i++) {
        object_initialize_child(obj, "usart[*]", &s->usart[i],
                                TYPE_STM32L552_USART);
    }

    for (i = 0; i < STM32L552_NUM_TIMERS; i++) {
        object_initialize_child(obj, "timer[*]", &s->timer[i],
                                TYPE_STM32F2XX_TIMER);
    }

    object_initialize_child(obj, "stm32l552-flash", &s->flash_regs, TYPE_STM32_FLASH_REGS);


    object_initialize_child(obj, TYPE_STM32L552_ADC, &s->adc, TYPE_STM32L552_ADC);


    qdev_prop_set_uint32(DEVICE(&s->adc), "input8" /* Version */,
            815);

    qdev_prop_set_uint32(DEVICE(&s->adc), "input9" /* Length? */,
            815);


    //for (i = 0; i < STM_NUM_ADCS; i++) {
    //    object_initialize_child(obj, "adc[*]", &s->adc[i], TYPE_STM32L552_ADC);


    //   qdev_prop_set_uint32(DEVICE(&s->adc[i]), "input9" /* Version */,
    //            122);

    //}

    for (i = 0; i < STM_NUM_SPIS; i++) {
        object_initialize_child(obj, "spi[*]", &s->spi[i], TYPE_STM32F2XX_SPI);

    if (1==1) {
          void *bus;


        bus = qdev_get_child_bus(DEVICE(&s->spi[i]), "ssi");
        object_initialize_child(OBJECT(bus), "nnasic", &s->asic1[i], TYPE_NN1002);
        //qdev_prop_set_uint8(&s->asic1, "input1" /* Test */,
        //                    47);
        // s->spi[i].ssi = s->asic1;


    }



    }
    #define NAME_SIZE 32
    char name[NAME_SIZE];

    for (i = 0; i < STM_NUM_GPIO; i++) {
        snprintf(name, NAME_SIZE, "GPIO%c", 'A' + i);
        object_initialize_child(obj, name, &s->gpio[i], TYPE_STM32FXXX_GPIO);
        //qdev_prop_set_uint8(DEVICE(s->gpio[i]), "port_id", i);
        //qdev_prop_set_ptr(DEVICE(s->gpio[i]), "state", &s->state);
    }


    object_initialize_child(obj, "exti", &s->exti, TYPE_STM32L552_EXTI);
    

    object_initialize_child(obj, "stm32l552-rcc", &s->rcc, TYPE_STM32L552_RCC);
    object_initialize_child(obj, "stm32fxxx-rtc", &s->rtc, TYPE_STM32L552_RTC);
    object_initialize_child(obj, "stm32-pwr", &s->pwr, TYPE_STM32L552_PWR);



    s->sysclk = qdev_init_clock_in(DEVICE(s), "sysclk", NULL, NULL, 0);
    s->refclk = qdev_init_clock_in(DEVICE(s), "refclk", NULL, NULL, 0);


}


static int gpio_realize_peripheral(ARMv7MState *cpu, stm32fxxx_gpio *dev, hwaddr base, unsigned int irqnr, Error **errp){
     SysBusDevice *busdev;
     DeviceState *armv7m;

    //object_property_set_bool(OBJECT(dev), "realized", true,  &error_fatal);
    if (!sysbus_realize(SYS_BUS_DEVICE(dev), errp)) {
        return 0;
    }
    busdev = SYS_BUS_DEVICE(dev);
    armv7m = DEVICE(cpu);
    sysbus_mmio_map(busdev, 0, base);
    sysbus_connect_irq(busdev, 0, qdev_get_gpio_in(armv7m, irqnr));

    //MemoryRegion *flash_alias = g_new(MemoryRegion, 1);
    //memory_region_init_alias(flash_alias, OBJECT(dev),
    //                         "STM32L552.flash.alias", &dev->flash, 0,
    //                         FLASH_SIZE);

    return 0;
}

static void stm32l552_soc_reset(DeviceState *dev)
 {
    STM32L552State *s = STM32L552_SOC(dev);
    /* Failed attempt to set truszone SCB registers 
       by looking at them in the debugger */
    s->armv7m.cpu->env.v7m.secure = s->armv7m.cpu->env.v7m.secure;
    s->armv7m.cpu->env.v7m.aircr = R_V7M_AIRCR_BFHFNMINS_MASK;
    s->armv7m.cpu->env.v7m.nsacr = 0xcff;
    CPUARMState *env = &s->armv7m.cpu->env;
    env->v7m.fpccr[M_REG_S]=env->v7m.fpccr[M_REG_S];
    env->sau.ctrl=0;
    env->sau.rbar[M_REG_NS]=0;
    s->armv7m.cpu->sau_sregion=0;
    env->sau.rlar[M_REG_NS]=0;
    env->v7m.ccr[M_REG_NS]=0;
    env->v7m.ccr[M_REG_S]=0x211;
    env->v7m.aircr=0x0fa05200;


