Ebiroll/qemu-stm32/hw/arm/stm32l552_soc.c
    }
    // create_unimplemented_device("RCC",         0x40023800, 0x400);
    /* RCC Device*/
    dev = DEVICE(&s->rcc);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->rcc), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, 0x40021000);

    // 0x40002800
    /* RTC Device*/
    dev = DEVICE(&s->rtc);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->rtc), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, 0x40002800);

    dev = DEVICE(&s->pwr);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->pwr), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, 0x40007000);


    /* EXTI device */
    dev = DEVICE(&s->exti);
    if (!sysbus_realize(SYS_BUS_DEVICE(&s->exti), errp)) {
        return;
    }
    busdev = SYS_BUS_DEVICE(dev);
    sysbus_mmio_map(busdev, 0, EXTI_ADDR);
    for (i = 0; i < 16; i++) {
        sysbus_connect_irq(busdev, i, qdev_get_gpio_in(armv7m, exti_irq[i]));
    }

    // sysbus_connect_irq(busdev, 27, qdev_get_gpio_in(armv7m, 62));


    // Alarm A
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->rtc), 0, qdev_get_gpio_in(dev, 22));
    // Alarm B
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->rtc), 1, qdev_get_gpio_in(dev, 22));
    // Wake up timer
    sysbus_connect_irq(SYS_BUS_DEVICE(&s->rtc), 2, qdev_get_gpio_in(dev, 17));

#define NVIC_RTC_ALARM_IRQ 41
#define EXTI_LINE_17 17

    sysbus_connect_irq(busdev, EXTI_LINE_17, qdev_get_gpio_in(armv7m, NVIC_RTC_ALARM_IRQ));


    s->armv7m.cpu->env.v7m.secure = false;
    CPUARMState *env = &s->armv7m.cpu->env;
    env->v7m.secure = false;
    env->v7m.fpccr[M_REG_S]=env->v7m.fpccr[M_REG_S];
    env->sau.ctrl=0;
    env->sau.rbar[M_REG_NS]=0;
    s->armv7m.cpu->sau_sregion=0;
    env->sau.rlar[M_REG_NS]=0;
    env->v7m.ccr[M_REG_NS]=0;
    env->v7m.ccr[M_REG_S]=0x211;
    env->v7m.aircr=0x0fa05200;




    //qdev_prop_set_bit(DEVICE(&s->armv7m.cpu->env), "secure", false);

    //for (i = 0; i < 16; i++) {
    //    qdev_connect_gpio_out(DEVICE(&s->syscfg), i, qdev_get_gpio_in(dev, i));
    //}

    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[0], 0x42020000, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[1], 0x42020400, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[2], 0x42020800, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[3], 0x42020C00, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[4], 0x42021000, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[5], 0x42021400, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[6], 0x42021800, 0, errp) < 0) return;
    if(gpio_realize_peripheral(&s->armv7m, &s->gpio[7], 0x42021C00, 0, errp) < 0) return;



/*
"Name","Start","End","Length","R","W","X","Volatile","Overlay","Type","Initialized","Byte Source","Source","Comment"
"TIM2_TIM3_TIM4_TIM5_TIM6_TIM7","40000000","400017ff","0x1800","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"TAMP_IWDG_SPI2_SPI3_WWDG_RTC","40002800","40003fff","0x1800","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"I2C1_I2C2_I2C3_CRS_UART5_UART4_USART3_USART2","40004400","400063ff","0x2000","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"I2C4_LPUART1_LPTIM1_OPAMP_DAC_PWR","40007000","400087ff","0x1800","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"LPTIM2_LPTIM3","40009400","40009bff","0x800","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"FDCAN1","4000a400","4000afff","0xc00","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"USB_UCPD1","4000d400","4000dfff","0xc00","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SYSCFG_VREFBUF_COMP","40010000","400103ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SPI1_TIM1_TIM8_USART1","40012c00","40013bff","0x1000","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"TIM15_TIM16_TIM17","40014000","40014bff","0xc00","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SAI1_SAI2","40015400","40015bff","0x800","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"DFSDM1","40016000","400167ff","0x800","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"DMAMUX1_DMA2_DMA1","40020000","40020bff","0xc00","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"RCC","40021000","400213ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"FLASH","40022000","400223ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"CRC","40023000","400233ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"TSC","40024000","400243ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"EXTI","4002f400","4002f7ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"ICache","40030400","400307ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"GTZC_MPCBB1_GTZC_MPCBB2_GTZC_TZIC_GTZC_TZSC","40032400","400333ff","0x1000","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"GPIOA_GPIOB_GPIOC_GPIOD_GPIOE_GPIOF_GPIOG_GPIOH","42020000","42021fff","0x2000","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"ADC","42028000","420282fc","0x2fd","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"ADC_Common","42028300","420283ff","0x100","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"RNG","420c0800","420c0bff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SDMMC1","420c8000","420c83fc","0x3fd","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"FMC","44020000","440203ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"OCTOSPI1","44021000","440213ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_TIM2_SEC_TIM3_SEC_TIM4_SEC_TIM5_SEC_TIM6_SEC_TIM7","50000000","500017ff","0x1800","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_TAMP_SEC_IWDG_SEC_SPI2_SEC_SPI3_SEC_WWDG_SEC_RTC","50002800","50003fff","0x1800","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_I2C1_SEC_I2C2_SEC_I2C3_SEC_CRS_SEC_UART5_SEC_UART4_SEC_USART3_SEC_USART2","50004400","500063ff","0x2000","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_I2C4_SEC_LPUART1_SEC_LPTIM1_SEC_OPAMP_SEC_DAC_SEC_PWR","50007000","500087ff","0x1800","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_LPTIM2_SEC_LPTIM3","50009400","50009bff","0x800","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_FDCAN1","5000a400","5000afff","0xc00","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_USB_SEC_UCPD1","5000d400","5000dfff","0xc00","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_SYSCFG_SEC_VREFBUF_SEC_COMP","50010000","500103ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_SPI1_SEC_TIM1_SEC_TIM8_SEC_USART1","50012c00","50013bff","0x1000","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_TIM15_SEC_TIM16_SEC_TIM17","50014000","50014bff","0xc00","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_SAI1_SEC_SAI2","50015400","50015bff","0x800","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_DFSDM1","50016000","500167ff","0x800","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_DMAMUX1_SEC_DMA2_SEC_DMA1","50020000","50020bff","0xc00","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_RCC","50021000","500213ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_FLASH","50022000","500223ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_CRC","50023000","500233ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_TSC","50024000","500243ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_EXTI","5002f400","5002f7ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_ICache","50030400","500307ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_GTZC_MPCBB1_SEC_GTZC_MPCBB2_SEC_GTZC_TZIC_SEC_GTZC_TZSC","50032400","500333ff","0x1000","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_GPIOA_SEC_GPIOB_SEC_GPIOC_SEC_GPIOD_SEC_GPIOE_SEC_GPIOF_SEC_GPIOG_SEC_GPIOH","52020000","52021fff","0x2000","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_ADC","52028000","520282fc","0x2fd","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_ADC_Common","52028300","520283ff","0x100","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_RNG","520c0800","520c0bff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_SDMMC1","520c8000","520c83fc","0x3fd","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_FMC","54020000","540203ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"SEC_OCTOSPI1","54021000","540213ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"NVIC","e000e100","e000e47c","0x37d","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"DCB","e000ee08","e000ee0c","0x5","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"NVIC_STIR","e000ef00","e000ef04","0x5","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
"DBGMCU","e0044000","e00443ff","0x400","true","true","false","true","false","Default","false","","","Generated by SVD-Loader."
*/

    //create_unimplemented_device("PWR",         0x40007000, 0x400);
                                            //   40014000
    //create_unimplemented_device("tim[3]",      0x40000400, 0x400);
    create_unimplemented_device("sec_tim[3]",  0x50000000, 0x400);
    //create_unimplemented_device("tim[3]",       0x40000400, 0x400);
    create_unimplemented_device("sec_tim[3]",   0x50000400, 0x400);
    //create_unimplemented_device("tim[4]",       0x40000800, 0x400);
    //create_unimplemented_device("sec_tim[4]",   0x50000800, 0x400);
    //create_unimplemented_device("tim[5]",       0x40000C00, 0x400);
    //create_unimplemented_device("sec_tim[5]",   0x50000C00, 0x400);
    //create_unimplemented_device("tim[6]",       0x40001000, 0x400);
    //create_unimplemented_device("sec_tim[6]",   0x50001000, 0x400);
    //create_unimplemented_device("tim[7]",       0x40001400, 0x400);
    //create_unimplemented_device("sec_tim[7]",   0x50001400, 0x400);
    create_unimplemented_device("DAC",          0x40007400, 0x400);
    create_unimplemented_device("SEC_DAC",      0x50007400, 0x400);
    create_unimplemented_device("OPAMP",        0x40007800, 0x400);
    create_unimplemented_device("SEC_OPAMP",    0x50007800, 0x400);
    create_unimplemented_device("timer[8]",      0x40013400, 0x400);
    create_unimplemented_device("sec_timer[8]",  0x50013400, 0x400);
    create_unimplemented_device("GTZC_TZIC",  0x40032800, 0x400);
    create_unimplemented_device("SEC_GTZC_TZIC",  0x50032800, 0x400);
    create_unimplemented_device("GTZC_TZSC",  0x40032400, 0x400);
    create_unimplemented_device("SEC_GTZC_TZSC",  0x50032400, 0x400);
    create_unimplemented_device("WWDG",  0x40002C00, 0x400);
    create_unimplemented_device("SEC_WWDG",  0x50002C00, 0x400);
    //create_unimplemented_device("SYSCFG",  0x40010000, 0x400);
    create_unimplemented_device("SEC_SYSCFG",  0x50010000, 0x400);
    create_unimplemented_device("DBGMCU",  0xE0044000, 0x400);
    create_unimplemented_device("USB",  0x4000D400, 0x800);
    create_unimplemented_device("SECUSB",  0x5000D400, 0x800);
    create_unimplemented_device("OCTOSPI1",  0x44021000, 0x400);
    create_unimplemented_device("SEC_OCTOSPI1",  0x54021000, 0x800);
    create_unimplemented_device("LPUART1",  0x40008000, 0x400);
    create_unimplemented_device("SEC_LPUART1",  0x50008000, 0x400);
    create_unimplemented_device("COMP",  0x40010200, 0x400);
    create_unimplemented_device("LP_COMP",  0x50010200, 0x400);
    create_unimplemented_device("VREFBUF",  0x40010030, 0x1D0);
    create_unimplemented_device("SEC_VREFBUF",  0x50010030, 0x400);
    create_unimplemented_device("TSC",  0x40024000, 0x1D0);
    create_unimplemented_device("SEC_TSC",  0x50024000, 0x400);
    create_unimplemented_device("UCPD1",  0x4000DC00, 0x400);
    create_unimplemented_device("SEC_UCPD1",  0x5000DC00, 0x400);
    create_unimplemented_device("FDCAN1",     0x4000A400, 0x400);
    create_unimplemented_device("SEC_FDCAN1", 0x5000A400, 0x400);
    create_unimplemented_device("CRC",     0x40023000, 0x400);
    create_unimplemented_device("SEC_CRC", 0x50023000, 0x400);
    //create_unimplemented_device("USART1",     0x40013800, 0x400);
    create_unimplemented_device("SEC_USART1", 0x50013800, 0x400);
    //create_unimplemented_device("USART2",     0x40004400, 0x400);
    create_unimplemented_device("SEC_USART2", 0x50004400, 0x400);
    //create_unimplemented_device("USART3",     0x40004800, 0x400);
    create_unimplemented_device("SEC_USART3", 0x50004800, 0x400);
    //create_unimplemented_device("USART4",     0x40004C00, 0x400);
    create_unimplemented_device("SEC_USART4", 0x50005000, 0x400);
    //create_unimplemented_device("USART5",     0x40005000, 0x400);
    create_unimplemented_device("SEC_USART5", 0x50005000, 0x400);
    //create_unimplemented_device("ADC_COMMON",     0x42028300, 0x400);
    create_unimplemented_device("SEC_ADC_Common", 0x52028300, 0x400);
    //create_unimplemented_device("ADC",     0x42028000, 0x400);
    create_unimplemented_device("SEC_ADC", 0x52028000, 0x400);

    //create_unimplemented_device("NVIC",     0xE000E100, 0x37D);
    create_unimplemented_device("NVIC_STIR", 0xE000EF00, 0x400);

    create_unimplemented_device("NVIC_SCB", 0xE000ED00, 0x100);

    //create_unimplemented_device("FMC",     0x44020000, 0x400);
    create_unimplemented_device("SEC_FMC", 0x54020000, 0x400);

    create_unimplemented_device("RNG",         0x420C0800, 0x400);
    create_unimplemented_device("SEC_RNG",     0x520C0800, 0x400);

    create_unimplemented_device("SDMMC1",         0x420C8000, 0x3DF);
    create_unimplemented_device("SEC_SDMMC1",     0x520C8000, 0x400);

// 

/*   create_unimplemented_device("timer[13]",   0x40001C00, 0x400);
    create_unimplemented_device("timer[14]",   0x40002000, 0x400);
    //create_unimplemented_device("RTC and BKP", 0x40002800, 0x400);
    create_unimplemented_device("WWDG",        0x40002C00, 0x400);
    create_unimplemented_device("IWDG",        0x40003000, 0x400);
    create_unimplemented_device("I2S2ext",     0x40003000, 0x400);
    create_unimplemented_device("I2S3ext",     0x40004000, 0x400);
    create_unimplemented_device("I2C1",        0x40005400, 0x400);
    create_unimplemented_device("I2C2",        0x40005800, 0x400);
    create_unimplemented_device("I2C3",        0x40005C00, 0x400);
    create_unimplemented_device("CAN1",        0x40006400, 0x400);
    create_unimplemented_device("CAN2",        0x40006800, 0x400);
    //create_unimplemented_device("PWR",         0x40007000, 0x400);
    create_unimplemented_device("timer[1]",    0x40010000, 0x400);
    create_unimplemented_device("timer[8]",    0x40010400, 0x400);
    create_unimplemented_device("SDIO",        0x40012C00, 0x400);
    create_unimplemented_device("timer[9]",    0x40014000, 0x400);
    create_unimplemented_device("timer[10]",   0x40014400, 0x400);
    create_unimplemented_device("timer[11]",   0x40014800, 0x400);
    //create_unimplemented_device("GPIOA",       0x40020000, 0x400);
    //create_unimplemented_device("GPIOB",       0x40020400, 0x400);
    //create_unimplemented_device("GPIOC",       0x40020800, 0x400);
    //create_unimplemented_device("GPIOD",       0x40020C00, 0x400);
    //create_unimplemented_device("GPIOE",       0x40021000, 0x400);
    create_unimplemented_device("GPIOF",       0x40021400, 0x400);
    create_unimplemented_device("GPIOG",       0x40021800, 0x400);
    create_unimplemented_device("GPIOH",       0x40021C00, 0x400);
    create_unimplemented_device("GPIOI",       0x40022000, 0x400);
    create_unimplemented_device("CRC",         0x40023000, 0x400);
    //create_unimplemented_device("RCC",         0x40023800, 0x400);
    create_unimplemented_device("Flash Int",   0x40023C00, 0x400);
    create_unimplemented_device("BKPSRAM",     0x40024000, 0x400);
    create_unimplemented_device("DMA1",        0x40026000, 0x400);
    create_unimplemented_device("DMA2",        0x40026400, 0x400);
    create_unimplemented_device("Ethernet",    0x40028000, 0x1400);
    create_unimplemented_device("USB OTG HS",  0x40040000, 0x30000);
    create_unimplemented_device("USB OTG FS",  0x50000000, 0x31000);
    create_unimplemented_device("DCMI",        0x50050000, 0x400);
    */
}

static Property stm32l552_soc_properties[] = {
    DEFINE_PROP_STRING("cpu-type", STM32L552State, cpu_type),
    DEFINE_PROP_END_OF_LIST(),
};

static void stm32l552_soc_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = stm32l552_soc_realize;
    device_class_set_props(dc, stm32l552_soc_properties);
    dc->reset = stm32l552_soc_reset;
    /* No vmstate or reset required: device has no internal state */
}

static const TypeInfo stm32l552_soc_info = {
    .name          = TYPE_STM32L552_SOC,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(STM32L552State),
    .instance_init = stm32l552_soc_initfn,
    .class_init    = stm32l552_soc_class_init,
};

static void stm32l552_soc_types(void)
{
    type_register_static(&stm32l552_soc_info);
}

type_init(stm32l552_soc_types)
